
&НаКлиенте
Процедура назначитьнаставников(Команда)
	Если НЕ(Объект.Профессия.Пустая()) Тогда
		ВыполнениеЗапроса();
	Иначе
		Сообщить("Выберите профессию назначения");
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Функция ВыполнениеЗапроса()
	Запрос = Новый Запрос;
	Если Объект.Должность.Наименование = "" Тогда
		Запрос.Текст = "ВЫБРАТЬ
		               |	ВложенныйЗапрос.Наставник КАК Наставник,
		               |	ВложенныйЗапрос.Наставник.Профессия КАК Профессия,
		               |	ВложенныйЗапрос.ПрикрепленОстаток КАК ПрикрепленОстаток,
		               |	ВложенныйЗапрос.ПриоритетДолжности КАК ПриоритетДолжности,
		               |	ВложенныйЗапрос.ТекущаяДолжность КАК ТекущаяДолжность
		               |ИЗ
		               |	(ВЫБРАТЬ
		               |		Наставники.Ссылка КАК Наставник,
		               |		ЕСТЬNULL(РегистрНаставникиОстатки.ПрикрепленОстаток, 0) КАК ПрикрепленОстаток,
		               |		Должности.Приоритет КАК ПриоритетДолжности,
		               |		Наставники.ТекущаяДолжность КАК ТекущаяДолжность
		               |	ИЗ
		               |		Справочник.Наставники КАК Наставники
		               |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РегистрНаставники.Остатки(&Период, ) КАК РегистрНаставникиОстатки
		               |			ПО Наставники.Ссылка = РегистрНаставникиОстатки.Наставник
		               |			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Должности КАК Должности
		               |			ПО Наставники.ТекущаяДолжность = Должности.Ссылка) КАК ВложенныйЗапрос
		               |ГДЕ
		               |	ВложенныйЗапрос.ПрикрепленОстаток = 0
		               |	И ВложенныйЗапрос.Наставник.Профессия = &Профессия
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	Профессия,
		               |	ТекущаяДолжность,
		               |	ПриоритетДолжности УБЫВ";
		Запрос.УстановитьПараметр("Период", Объект.Дата);
		Запрос.УстановитьПараметр("Профессия", Объект.Профессия);
	Иначе
		Запрос.Текст = "ВЫБРАТЬ
		               |	ВложенныйЗапрос.Наставник КАК Наставник,
		               |	ВложенныйЗапрос.Наставник.Профессия КАК Профессия,
		               |	ВложенныйЗапрос.ПрикрепленОстаток КАК ПрикрепленОстаток,
		               |	ВложенныйЗапрос.ПриоритетДолжности КАК ПриоритетДолжности,
		               |	ВложенныйЗапрос.ТекущаяДолжность КАК ТекущаяДолжность
		               |ИЗ
		               |	(ВЫБРАТЬ
		               |		Наставники.Ссылка КАК Наставник,
		               |		ЕСТЬNULL(РегистрНаставникиОстатки.ПрикрепленОстаток, 0) КАК ПрикрепленОстаток,
		               |		Должности.Приоритет КАК ПриоритетДолжности,
		               |		Наставники.ТекущаяДолжность КАК ТекущаяДолжность
		               |	ИЗ
		               |		Справочник.Наставники КАК Наставники
		               |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РегистрНаставники.Остатки(&Период, ) КАК РегистрНаставникиОстатки
		               |			ПО Наставники.Ссылка = РегистрНаставникиОстатки.Наставник
		               |			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Должности КАК Должности
		               |			ПО Наставники.ТекущаяДолжность = Должности.Ссылка) КАК ВложенныйЗапрос
		               |ГДЕ
		               |	ВложенныйЗапрос.ПрикрепленОстаток = 0
					   | 	И ВложенныйЗапрос.ТекущаяДолжность = &Должность
		               |	И ВложенныйЗапрос.Наставник.Профессия = &Профессия
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	Профессия,
		               |	ТекущаяДолжность,
		               |	ПриоритетДолжности УБЫВ";
		Запрос.УстановитьПараметр("Период", Объект.Дата);
		Запрос.УстановитьПараметр("Должность", Объект.Должность);
		Запрос.УстановитьПараметр("Профессия", Объект.Профессия);	
	КонецЕсли;	
		
	Запрос = Запрос.Выполнить().Выгрузить();
	
	СтрокаЗапроса = 0;
	Для Каждого СтрокаТЧ из Объект.ТабличнаяЧасть1 Цикл
		Попытка
			СтрокаТЧ.Наставник = Запрос[СтрокаЗапроса].Наставник;
			СтрокаЗапроса = СтрокаЗапроса + 1;
		Исключение
		 	Сообщить("Больше нет наставников по такой профессии");
			Прервать;
		КонецПопытки;
	КонецЦикла;
КонецФункции
