&НаСервере
Процедура УстановкаПараметровСеанса(ТребуемыеПараметры)
	
	// получаем имя пользователя поз которым пользователь входит в базу
	ИмяТекущегоПользователя = ПользователиИнформационнойБазы.ТекущийПользователь().Имя;
	
	// ищем пользователя в справочнике пользователей
	НайденныйПользователь = Справочники.Пользователи.НайтиПоНаименованию(ИмяТекущегоПользователя);
	
	// проверяйм удалось ли найти пользователя в справочнике
	Если ЗначениеЗаполнено(НайденныйПользователь) Тогда
		
		// сохраняем пользователя в параметр сеансов, что бы можно было в любой момент его получить
		ПараметрыСеанса.ТекущийПользователь = НайденныйПользователь;
		
	Конецесли;
	
КонецПроцедуры
