Перем ПарольПользователя Экспорт;

Процедура ПередЗаписью(Отказ)
	
	Если ЭтоНовый() Тогда  // если пользователь только создается
	
		// создаем нового пользователя в служебном справочнике пользователей
		НовыйПользователь = ПользователиИнформационнойБазы.СоздатьПользователя();
		
	Иначе 
		
		// находим пользователя по имени в служебном справочнике пользоваелей
		НовыйПользователь = ПользователиИнформационнойБазы.НайтиПоИмени(ЭтотОбъект.Код);
		
		//если не удалось найти пользователя, значит имя пользователя поменяли
		Если НовыйПользователь = Неопределено Тогда
			
		    Отказ = Истина;
			сообщить("Имя пользователя менять в пользовательском режиме нельзя. Поменяйте имя в конфигураторе, а потом в справочнике");
			Возврат;
			
		КонецЕсли;
	
	КонецЕсли;
	
	// в переменную записываем данные из формы
	НовыйПользователь.Имя = ЭтотОбъект.Наименование;
	Если Роль = Перечисления.Роли.Администратор Тогда
		НовыйПользователь.Роли.Добавить(Метаданные.Роли.Администратор);
	ИначеЕсли Роль = Перечисления.Роли.Наставник Тогда 
		НовыйПользователь.Роли.Добавить(Метаданные.Роли.Наставник);
	ИначеЕсли Роль = Перечисления.Роли.Стажер Тогда
		НовыйПользователь.Роли.Добавить(Метаданные.Роли.Стажер);
	КонецЕсли;
	НовыйПользователь.ПолноеИмя = ЭтотОбъект.Наименование;
	
	НовыйПользователь.Пароль = ПарольПользователя;
	НовыйПользователь.АутентификацияСтандартная = Истина;	
	НовыйПользователь.ПоказыватьВСпискеВыбора = Истина;
	НовыйПользователь.Язык = Метаданные.Языки.Русский;
	
	// записываем результат изменений
	НовыйПользователь.Записать(); 

КонецПроцедуры
