
Процедура ОбработкаПроведения(Отказ, Режим)
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РегистрНаставники.Наставник КАК Наставник,
		|	РегистрНаставники.Стажер КАК Стажер,
		|	СУММА(РегистрНаставники.Прикреплен) КАК Прикреплен
		|ИЗ
		|	РегистрНакопления.РегистрНаставники КАК РегистрНаставники
		|ГДЕ
		|	РегистрНаставники.Стажер = &Стажер
		|	И РегистрНаставники.Наставник = &Наставник
		|	И РегистрНаставники.Период <= &Период
		|
		|СГРУППИРОВАТЬ ПО
		|	РегистрНаставники.Наставник,
		|	РегистрНаставники.Стажер";
	
	Запрос.УстановитьПараметр("Наставник", Наставник);
	Запрос.УстановитьПараметр("Стажер", Стажер);
	Запрос.УстановитьПараметр("Период", Дата);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
	
		Сообщить("Ошибка");
		Отказ = Истина;
		Возврат;
		
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ВыборкаДетальныеЗаписи.Прикреплен = 0 Тогда
		
			 Сообщить("Ошибка");
			 Отказ = Истина;
			 Возврат;
		
		Иначе
		
			Движения.РегистрНаставники.Записывать = Истина;
			Движение = Движения.РегистрНаставники.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = Дата;
			Движение.Наставник = Наставник;
			Движение.Прикреплен = 1;
			Движение.Стажер = Стажер;
		
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры