
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ТекущийПользователь = МодульРаботыСПользователями.СведенияОПользователе();
	Запрос(ТекущийПользователь);
КонецПроцедуры

&НаСервере
Функция Запрос(ТекущийПользователь)
	Запрос = новый запрос;
	Если ТекущийПользователь.Роль = Перечисления.Роли.Администратор или ТекущийПользователь.Роль = Перечисления.Роли.Наставник Тогда
		Запрос.Текст = "ВЫБРАТЬ
		               |	РегистрНаставники.Регистратор КАК Регистратор,
		               |	РегистрНаставники.Наставник КАК Наставник,
		               |	РегистрНаставники.Стажер КАК Стажер,
		               |	РегистрНаставники.МоментВремени КАК МоментВремени
		               |ИЗ
		               |	РегистрНакопления.РегистрНаставники КАК РегистрНаставники
					   |Где
					   |	Наставник = &Наставник";
		Запрос.УстановитьПараметр("Наставник", ТекущийПользователь.СсылкаНаСправочникНаставникСтажер.Наименование);
		
		Элементы.Приветствие.Заголовок = "Ваши закрепления со стажером";
	Иначе
		Запрос.Текст = "ВЫБРАТЬ
		               |	РегистрНаставники.Регистратор КАК Регистратор,
		               |	РегистрНаставники.Наставник КАК Наставник,
		               |	РегистрНаставники.Стажер КАК Стажер,
		               |	РегистрНаставники.МоментВремени КАК МоментВремени
		               |ИЗ
		               |	РегистрНакопления.РегистрНаставники КАК РегистрНаставники
					   |Где
					   |	Стажер = &Стажер";
		Запрос.УстановитьПараметр("Стажер", ТекущийПользователь.СсылкаНаСправочникНаставникСтажер);	
		
		Элементы.Приветствие.Заголовок = "Ваши закрепления с наставником";
	КонецЕсли;
	ответ = Запрос.Выполнить().Выгрузить();
	Реквизит1.Загрузить(ответ);
КонецФункции;
